config.org
#+PROPERTY: header-args :tangle ~/.config/doom/config.el :results replace :exports code :tangle yes
#+startup: fold
#+EXPORT_FILE_NAME: ~/org/exported/config
#+options: coverpage yes
#+latex_class: chameleon

!!!! IMPORTANT !!!
#+begin_src emacs-lisp
;; (setq debug-on-error t)
;; (setq debug-on-interrupt t)
;; (setq debug-init t)
#+end_src

#+RESULTS:

* TODO Emacs config



[[https://tecosaur.github.io/emacs-config/config.html][Doom Emacs Configuration]]

another helpful config I found recently:
[[https://hieuphay.com/doom-emacs-config/][another one]]

* Server style
#+begin_src emacs-lisp
(add-hook 'doom-first-frame-hook
          (lambda ()
            (unless (daemonp) ; Check if Emacs is already a daemon (server)
              (server-start)))) ; Start the Emacs server if not already running
#+end_src


** Leftover block from the original config.el file, has some helpful reminders so I'll keep it
#+BEGIN_SRC emacs-lisp
;; -*- lexical-binding: t -*-
;; Whenever you reconfigure a package, make sure to wrap your config in an
;; `after!' block, otherwise Doom's defaults may override your settings. E.g.
;;
;;   (after! PACKAGE
;;     (setq x y))
;;
;; The exceptions to this rule:
;;
;;   - Setting file/directory variables (like `org-directory')
;;   - Setting variables which explicitly tell you to set them before their
;;     package is loaded (see 'C-h v VARIABLE' to look up their documentation).
;;   - Setting doom variables (which start with 'doom-' or '+').
;;
;; Here are some additional functions/macros that will help you configure Doom.
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+END_SRC

#+RESULTS:
* Config Boilerplate
** Telling Emacs who I am (they are in my skin)
#+BEGIN_SRC emacs-lisp
;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets. It is optional.
 (setq user-full-name "Liam Wirth"
       user-mail-address "ltwirth@asu.edu")


;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; (setq org-directory "~/org/")
(setq org-directory (file-truename "~/org/")) ;; File truename allows for symbolic link resolution
(setq org-roam-directory (file-truename "~/org/roam/"))
(md-roam-mode 1)
(setq md-roam-file-extension "md")
;; I've been on-and off trying to use the org agenda, and i like the ideas of org-roam-daily as a way to quickly make/maintain daily notes.
;; I thought to myself "why not try to combine the two?"
(setq org-agenda-files '("~/org/roam/daily/" "~/org/"))
#+END_SRC

#+RESULTS:


*** Epic Sauce Defaults
#+begin_src emacs-lisp
(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      truncate-string-ellipsis "…"                ; Unicode ellispis are nicer than "...", and also save /precious/ space
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      scroll-preserve-screen-position 'always     ; Don't have `point' jump around
      scroll-margin 2                             ; It's nice to maintain a little margin
      display-time-default-load-average nil       ; I don't think I've ever found this useful
      display-line-numbers-type 'relative         ; RelNum ON TOP
      )


(display-time-mode 1)                             ; Enable time in the mode-line
(global-subword-mode 1)                           ; Iterate through CamelCase words
(pixel-scroll-precision-mode t)                   ; Turn on pixel scrolling



(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t                               ; Stretch cursor to the glyph width
 show-paren-mode 1                                ; Highlight Matching Parenthesis
 abbrev-mode t                                    ; erm..
)
#+end_src

#+RESULTS:
: t
Its stupid to me that doom wont start in fullscreen by default
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(width . 92))
(add-to-list 'default-frame-alist '(height . 40))
#+end_src

#+RESULTS:
: ((buffer-predicate . doom-buffer-frame-predicate) (right-divider-width . 1) (bottom-divider-width . 1) (font . JetBrains Mono-15) (height . 40) (width . 92) (vertical-scroll-bars) (tool-bar-lines . 0) (menu-bar-lines . 0) (left-fringe . 8) (right-fringe . 8))

if you for some unholy reason want to split the window to the left, or above when there's only one window open,
you're a psychopath here, I am setting things up to NOT do that
#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t
      ;; evil-split-window-left f
      ;; evil-split-window-above f
        )
#+end_src

#+RESULTS:
: t


*** Frame title, sets a bit neater/nicer
#+begin_src emacs-lisp :results none :tangle no
;; (setq frame-title-format
;;       '(""
;;         (:eval
;;          (if (s-contains-p org-roam-directory (or buffer-file-name ""))
;;              (replace-regexp-in-string
;;               ".*/[0-9]*-?" "☰ "
;;               (subst-char-in-string ?_ ?  buffer-file-name))
;;            "%b"))
;;         (:eval
;;          (let ((project-name (projectile-project-name)))
;;            (unless (string= "-" project-name)
;;              (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))
#+end_src


*** Setting up the custom-file (to be used sparingly)
#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

#+RESULTS:
: t


**** Prompting for which buffer to open
just a nice little QOL thing
#+begin_src emacs-lisp :tangle no
;; (defadvice! prompt-for-buffer (&rest _)
;;   :after '(evil-window-split evil-window-vsplit)
;;   (consult-buffer))
#+end_src

#+RESULTS:

*** Window Rotation
good ol keybinds and such
#+begin_src emacs-lisp
(map! :map evil-window-map
      "SPC" #'rotate-layout
      ;; Navigation
      "<left>"     #'evil-window-left
      "<down>"     #'evil-window-down
      "<up>"       #'evil-window-up
      "<right>"    #'evil-window-right
      ;; Swapping windows
      "C-<left>"       #'+evil/window-move-left
      "C-<down>"       #'+evil/window-move-down
      "C-<up>"         #'+evil/window-move-up
      "C-<right>"      #'+evil/window-move-right)

(setq evil-vsplit-window-right t
      evil-split-window-below t)
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))
#+end_src

#+RESULTS:

** Hippie Expand stuff
#+begin_src emacs-lisp :tangle no
;; (global-set-key [remap dabbrev-expand] #'hippie-expand)
;; (setq hippie-expand-try-functions-list
;;       '(try-complete-file-name-partially
;;         try-complete-file-name
;;         try-expand-all-abbrevs
;;         try-expand-list
;;         try-expand-dabbrev
;;         try-expand-dabbrev-all-buffers
;;         try-expand-dabbrev-from-kill
;;         try-expand-line
;;         try-complete-lisp-symbol-partially
;;         try-complete-lisp-symbol))
#+end_src

#+RESULTS:

* Looks
I intend to configure the overal look and feel of my emacs configuration here, as well as any packages/modules that would affect how it looks and feels
I.E

To See stuff responsible for org mode look and feel, see:
