config.org
** Font!
#+begin_src emacs-lisp
;; Doom exposes five (optional) variables for controlling fonts in Doom:
;;
;; - `doom-font' -- the primary font to use
;; - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
;; - `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;; - `doom-symbol-font' -- for symbols
;; - `doom-serif-font' -- for the `fixed-pitch-serif' face

(set-face-attribute 'default nil
                    :font "JetBrains Mono NerdFont"
                    :height 120
                    :weight 'medium)
(set-face-attribute 'variable-pitch nil
                    :font "Overpass"
                    :height 130
                    :weight 'medium)
(set-face-attribute 'fixed-pitch nil
                    :font "JetBrains Mono"
                    :height 130
                    :weight 'medium);; This is working in emacsclient but not emacs.
;; Your font must have an italic face available.
(set-face-attribute 'font-lock-comment-face nil
                    :slant 'italic)
;;(set-face-attribute 'font-lock-keyword-face nil
;; :slant 'italic)
(set-face-attribute 'doom-serif-font (font-spec :family "IBM Plex Mono" :size 22 :weight 'light))
(set-face-attribute 'doom-symbol-font (font-spec :family "JuliaMono"))
(add-to-list 'default-frame-alist '(font . "JetBrains Mono-18"))

(setq-default line-spacing 0.05)
#+end_src

#+RESULTS:
: 0.05

#+RESULTS:
| [\(?:\*?[=+>]\) 0 font-shape-gstring] |

** Theme!
#+begin_src emacs-lisp
(setq doom-theme 'doom-gruvbox
      doom-themes-treemacs-enable-variable-pitch nil)
#+end_src

** +Action+! Variables relevant to look and feel!
#+begin_src emacs-lisp
(blink-cursor-mode -1)
(column-number-mode t)
(transient-mark-mode t)
#+end_src
#+RESULTS:
: t

** Doom Modeline
#+begin_src emacs-lisp
(after! doom-modeline
  (setq doom-modeline-enable-word-count t)
  (setq doom-modeline-icon t)
  (setq doom-modeline-persp-name t)
  (setq doom-modeline-height 45)
  (setq doom-modeline-lsp-icon t)
  (setq doom-modeline-total-line-number t)
  (setq doom-modeline-lsp t)
  (setq doom-modeline-modal-icon t)
  (setq doom-modeline-modal-modern-icon t)
  (setq doom-modeline-battery t)
  (setq doom-modeline-time t)
  (setq doom-modeline-env-version t)
  (setq doom-modeline-time-clock-size 0.65)
  ;;(setq      doom-modeline-hud nil)
  (setq      doom-themes-padded-modeline t)
  (add-hook! 'doom-modeline-mode-hook
    (progn
      (set-face-attribute 'header-line nil
                          :background (face-background 'mode-line)
                          :foreground (face-foreground 'mode-line))
      ))
  )
#+end_src

** Info-Colors
#+begin_src emacs-lisp
(use-package! info-colors
:commands (info-colors-fontify-node))
#+end_src

* Configuring Plugins (Misc)
** WakaTime
*** WakaTime
#+begin_src emacs-lisp
(use-package wakatime-mode
  :ensure t)
#+end_src
#+begin_src emacs-lisp
(global-wakatime-mode t)
#+end_src

#+RESULTS:
: t

** Which-Key
it's like the one from neovim? (or is it the other way around?)
#+begin_src emacs-lisp
(after! which-key
  (setq which-key-idle-delay 0.2))

(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
   ))
(setq which-key-allow-multiple-replacements t)
#+end_src
#+RESULTS:
: t


** Treemacs
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("e" . "explorer")
       :desc "Toggle Treemacs" "t" #'treemacs))
#+end_src

#+RESULTS:
: treemacs

* Org

** ORG-ROam Markdown Support (I'm still not sure if I wanna just use obsidian or this, so this is helpful)
#+begin_src emacs-lisp
(use-package! md-roam
  :load-path "packages/md-roam" ; Assuming you install md-roam in ~/.doom.d/packages/md-roam/ (adjust if needed)
  :config
  (md-roam-mode 1)
  (setq md-roam-file-extension "md")) ; Optional, defaults to "md"
#+end_src

#+RESULTS:
: t

*** They also support adding a capture template
#+begin_src emacs-lisp
(after! org-roam
  (add-to-list 'org-roam-capture-templates
               '("m" "Markdown" plain ""
                 :target (file+head "%<%Y-%m-%dT%H%M%S>.md"
                                   "---\ntitle: ${title}\nid: %<%Y-%m-%dT%H%M%S>\ncategory: \n---\n")
                 :unnarrowed t)))
#+end_src


#+RESULTS:
#+begin_src emacs-lisp
        (defun my/generate-roam-id ()
          (format-time-string "%Y%m%d%H%M%S"))
#+end_src

#+RESULTS:
: my/generate-roam-id

** \Todo faces and the like
#+begin_src emacs-lisp
;; Custom todo states
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)" "SOMEDAY(s)")))

;; Custom faces for the todo states
(setq org-todo-keyword-faces
      '(("TODO" . org-warning)
        ("NEXT" . "orange")
        ("WAITING" . "yellow")
        ("CANCELLED" . (:foreground "blue" :weight bold :strike-through t))
        ("SOMEDAY" . (:foreground "magenta" :weight bold))))

;; Setup org-agenda for that jawn
 (setq org-agenda-custom-commands
      '(("c" "Simple agenda view"
         ((agenda "")
          (todo "TODO")
          (todo "NEXT")
          (todo "WAITING")
          (todo "SOMEDAY")))))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
;; Setup Org agenda to by default exclude cancelled stuff
(setq org-agenda-todo-ignore-states '("SOMEDAY" "CANCELLED"))

#+end_src

also add some keybinds for org-agenda
#+begin_src emacs-lisp
(setq org-agenda-custom-commands
      '(("S" "Special states"
         ((todo "SOMEDAY|CANCELLED"
                ((org-agenda-overriding-header "Someday/Maybe and Cancelled items:"))))
        ("s" "Someday items"
         ((todo "SOMEDAY"
                ((org-agenda-overriding-header "Someday/Maybe items:"))))
        ("c" "Cancelled items"
         ((todo "CANCELLED"
                ((org-agenda-overriding-header "Cancelled items:"))))
        ("a" "Active TODOs (exclude SOMEDAY and CANCELLED)"
         ((todo ""
                ((org-agenda-todo-ignore-states '("SOMEDAY" "CANCELLED"))
                 (org-agenda-overriding-header "Active TODOs (excluding SOMEDAY and CANCELLED):"))))))))))
#+end_src

#+RESULTS:

** Org Modern
the key to it looking *pretty*
#+begin_src emacs-lisp
(after! org
  (use-package! org-modern
 :config
(setq org-special-ctrl-a/e t)
(setq org-insert-heading-respect-content t)
  ;; appearance
  (setq org-modern-radio-target    '("❰" t "❱"))
  (setq org-modern-internal-target '("↪ " t "")) ; TODO: make this not be an emoji, and instead a font lig
  (setq org-modern-todo t)
  (setq org-modern-todo-faces
  '(("TODO" :inverse-video t :inherit org-todo)
   ("PROJ" :inverse-video t :inherit +org-todo-project)
   ("STRT" :inverse-video t :inherit +org-todo-active)
   ("[-]"  :inverse-video t :inherit +org-todo-active)
   ("HOLD" :inverse-video t :inherit +org-todo-onhold)
   ("WAIT" :inverse-video t :inherit +org-todo-onhold)
   ("[?]"  :inverse-video t :inherit +org-todo-onhold)
   ("KILL" :inverse-video t :inherit +org-todo-cancel)
   ("NO"   :inverse-video t :inherit +org-todo-cancel)))
  (setq org-modern-footnote (cons nil (cadr org-script-display)))
   (setq org-modern-block-name
   '((t . t)
     ("src" "»" "«")
     ("example" "»–" "–«")
     ("quote" "❝" "❞")
     ("export" "⏩" "⏪")))
   (setq org-modern-priority nil)
   (setq org-modern-progress nil)
   ; org-modern-horizontal-rule (make-string 36 ?─)
   (setq org-modern-horizontal-rule "──────────")
  ; org-modern-hide-stars "·"
   (setq org-modern-star '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶"))
   (setq org-modern-keyword
        '((t . t)
          ("title" . "𝙏")
          ("subtitle" . "𝙩")
          ("author" . "𝘼")
          ("date" . "𝘿")
          ("property" . "☸")
          ("options" . "⌥")
          ("startup" . "⏻")
          ("macro" . "𝓜")
          ("include" . "⇤")
          ("setupfile" . "⇚")
          ("html_head" . "🅷")
          ("html" . "🅗")
          ("latex_class" . "🄻")
          ("latex_header" . "🅻")
          ("latex_header_extra" . "🅻⁺")
          ("latex" . "🅛")
          ("beamer_theme" . "🄱")
          ("beamer_header" . "🅱")
          ("beamer" . "🅑")
          ("attr_latex" . "🄛")
          ("attr_html" . "🄗")
          ("attr_org" . "⒪")
          ("name" . "⁍")
          ("header" . "›")
          ("caption" . "☰")
          ("results" . "🠶")))
  (custom-set-faces! '(org-modern-statistics :inherit org-checkbox-statistics-todo)))
)
#+end_src
#+RESULTS:
: t

#+begin_src emacs-lisp :tangle yes
(after! org (add-hook 'org-mode-hook #'org-modern-mode))
#+end_src
** Look and Feel
