config.org
*** Custom Faces
I know this gets ran/called
Using medium weights and stuff for our headers, as well as making them larger
#+begin_src emacs-lisp :tangle yes
(after! org-mode
  (custom-set-faces!
    '((org-document-title)
      :foreground ,(face-attribute 'org-document-title :foreground)
      :height 2.0
      :weight bold
      )
    '((org-level-1)
      :height 1.7
      :weight medium
      :foreground ,(face-attribute 'outline-1 :foreground)
      )
    '((org-level-2)
      :height 1.6
      :weight medium
      :foreground ,(face-attribute 'outline-2 :foreground)
      )
    '((org-level-3)
      :height 1.5
      :weight medium
      :foreground ,(face-attribute 'outline-3 :foreground)
      )
    '((org-level-4)
      :height 1.4
      :weight medium
      :foreground ,(face-attribute 'outline-4 :foreground)
      )
    '((org-level-5)
      :height 1.3
      :weight medium
      :foreground ,(face-attribute 'outline-5 :foreground)
      )
    '((org-level-6)
      :height 1.2
      :weight medium
      :foreground ,(face-attribute 'outline-6 :foreground)
      )
    '((org-level-7)
      :height 1.1
      :weight medium
      :foreground ,(face-attribute 'outline-7 :foreground)
      )
    ))
#+end_src

#+RESULTS:

*** Org-Ellipsis
#+begin_src emacs-lisp
(after! org
(setq org-ellipsis "▾")
(setq org-hide-leading-stars t)
(setq org-priority-highest ?A)
(setq org-priority-lowest ?E)
(setq org-priority-faces
      '((?A . 'nerd-icons-red)
        (?B . 'nerd-icons-orange)
        (?C . 'nerd-icons-yellow)
        (?D . 'nerd-icons-green)
        (?E . 'nerd-icons-blue))))

#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(appendq! +ligatures-extra-symbols
          (list :list_property "∷"
                :em_dash       "—"
                :ellipses      "…"
                :arrow_right   "→"
                :arrow_left    "←"
                :arrow_lr      "↔"
                :properties    "⚙"
                :end           "∎"
                :priority_a    #("⚑" 0 1 (face nerd-icons-red))
                :priority_b    #("⬆" 0 1 (face nerd-icons-orange))
                :priority_c    #("■" 0 1 (face nerd-icons-yellow))
                :priority_d    #("⬇" 0 1 (face nerd-icons-green))
                :priority_e    #("❓" 0 1 (face nerd-icons-blue))))
#+end_src

#+RESULTS:


** Keybind
#+begin_src emacs-lisp
(map! :after org
      :map org-mode-map
      :localleader
      :desc "Org-Mark-Ring jump" "gj" #'org-mark-ring-goto
      )
(map! :after org
      :map org-mode-map
      :localleader
      :desc "Org-Mark-Ring Save" "gs" #'org-mark-ring-push)
#+end_src

#+RESULTS:

*** A silly little keybind idea
open up a custom little swag baby gangster type thing whenever I hit a keybind while in a src block to enter a temp buffer
#+begin_src emacs-lisp
(defun open-temp-buffer-src ()
"Open Temporary Buffer When Editing Src Blocks"
(interactive)
(org-edit-src-code)
)
#+end_src

#+RESULTS:
: open-temp-buffer-src



#+begin_src emacs-lisp
(map! :after org
      :map org-mode-map
      :localleader
      :desc "Org Set Property" "O" #'org-set-property)
(map! :after org
      :map org-mode-map
      :localleader
      :n "o" #'org-edit-src-code)
#+end_src
#+RESULTS:

** Babel
*** Default Header Args
TODO setup the completion thingy to be more friendly with these
#+begin_src emacs-lisp :tangle yes
(setq org-babel-default-header-args
      '((:session . "none")
        (:results . "replace")
        (:exports . "code")
        (:cache . "no")
        (:noweb . "no")
        (:hlines . "yes")
        (:tangle . "yes")
        (:comments . "link")))

#+END_SRC
#+RESULTS:
: ((:session . none) (:results . replace) (:exports . code) (:cache . no) (:noweb . no) (:hlines . yes) (:tangle . yes) (:comments . link))

*** Load Languages:
#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((dot . t)
   '(emacs-lisp . t)
   '(mips . t)
   '(python . t)
   '(latex . t)
   '(rust . t)
   '(C . t)
   '(cpp . t)))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(require 'org)
(require 'ob)
(require 'ob-C)
#+end_src

#+RESULTS:
: ob-C

** Org-Latex
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'turn-on-org-cdlatex)
(defadvice! +org-edit-latex-env-after-insert-a (&rest _)
  :after #'org-cdlatex-environment-indent
  (org-edit-latex-environment))
#+end_src

#+RESULTS:

*** TODO Defining our font size for inline tex
TODO: Make it bold/better matching to my regular written font weight
would be cool to have this be set dynamically based on how zoomed in the buffer is
#+begin_src emacs-lisp
;; Calibrated based on the TeX font and org-buffer font.
(plist-put org-format-latex-options :zoom 1.93)
(after! org (plist-put org-format-latex-options :scale 3.0))
#+end_src

#+RESULTS:

** TODO Org-Roam
I would like to add a function that would make the default roam "template" have a few added things
namely latex_class = chameleon
and exported_file_name = ~/org/exported
#+begin_src emacs-lisp
(after! org
  (setq org-roam-directory  "~/org/roam/")
  (setq org-modern-mode t)
  (setq org-roam-directory (file-truename "~/org/roam/"))
  (setq org-roam-completion-everywhere t)
  (setq org-roam-file-extensions '("org" "md"))
  (require 'md-roam)
  (md-roam-mode 1)
  (org-roam-db-autosync-mode 1)
)
#+end_src

#+RESULTS:
: t
** Org-Similarity
#+begin_src emacs-lisp
(use-package! org-similarity
 :after org  ; Ensure it loads after org-mode
 :commands (org-similarity-insert-list
            org-similarity-sidebuffer
            org-similarity-query) ; Autoload commands
 :config
 (setq org-similarity-directory org-roam-directory) ; Or org-directory if not using org-roam
(setq org-similarity-file-extension-pattern "*.org\\|*.md") ;; Can look at markdown >:)
 (setq org-similarity-language "english") ; Or your preferred language
 (setq org-similarity-algorithm "tfidf") ; Or "bm25"
 (setq org-similarity-number-of-documents 10) ; Adjust as desired
 (setq org-similarity-min-chars 0) ; Adjust if needed
 (setq org-similarity-show-scores t) ; Set to t to see similarity scores initially
 (setq org-similarity-threshold 0.05) ; Adjust if needed
 (setq org-similarity-use-id-links t) ; Recommended for org-roam v2
 (setq org-similarity-recursive-search nil) ; Or t for recursive search
 (setq org-similarity-custom-python-interpreter nil) ; Let it manage venv
 (setq org-similarity-remove-first nil)
 (setq org-similarity-heading "** Related notes") ; Customize heading if you like
 (setq org-similarity-prefix "- ") ; Customize prefix if you like
 (setq org-similarity-ignore-frontmatter nil) ; Or t to ignore frontmatter
 )
#+end_src

**  org-roam timestamps

#+begin_src emacs-lisp
(use-package! org-roam-timestamps
  :after org-roam
  :config (org-roam-timestamps-mode))
	(after! org-roam
	(setq org-roam-timestamps-parent-file t)
	(setq org-roam-timestamps-remember-timestamps t))
#+end_src

** Org-Capture from browser
First need to make sure the protocol is on (it should be?)
   #+begin_src emacs-lisp
    (after! org
 (add-to-list 'org-roam-capture-templates
            '(("w" "Web Capture" plain
               "* [[%:link][%:title]] :web: :[[file:tags.org::*KEYWORDS][KEYWORDS]]\n  Captured on: %U\n  Source: %:link\n  \n  %input"
               :unnarrowed t :jump-to-captured t))))
    #+end_src
    #+begin_src emacs-lisp :tangle yes
(setq org-roam-capture-ref-templates
  '(("r" "ref" plain "* %U\n
%(zp/org-protocol-insert-selection-dwim \"%i\")%?"
     :target (file+head "web/${slug}.org"
                        "#+title: ${title}\n
,#+roam_key: ${ref}\n
,#+created: %u\n"  ;; <-- COMMA HERE
                        )
     :unnarrowed t)))


    #+end_src

    #+RESULTS:


org roam does this thing where it prepends all the files with a ton of numbers and stuff, I think it's just timestamp data. Anyways, it'll be nice to have a function that can take that name and remove all those excess numbers and just get the rest of the string
#+begin_src emacs-lisp
(defadvice! doom-modeline--buffer-file-name-roam-aware-a (orig-fun)
  :around #'doom-modeline-buffer-file-name ; takes no args
  (if (s-contains-p org-roam-directory (or buffer-file-name ""))
      (replace-regexp-in-string
       "\\(?:^\\|.*/\\)\\([0-9]\\{4\\}\\)\\([0-9]\\{2\\}\\)\\([0-9]\\{2\\}\\)[0-9]*-"
       "🢔(\\1-\\2-\\3) "
       (subst-char-in-string ?_ ?  buffer-file-name))
    (funcall orig-fun)))
#+end_src

#+RESULTS:

