config.org
*** Defining Some Custom Commands
#+begin_src emacs-lisp
; preface, I stole this straight from the internet, so I dunno even if this will work, and only have a loose Idea as to how it should work
(defun my/org-roam-today-mk-agenda-link ()
  (interactive)
  (let* ((marker (or (org-get-at-bol 'org-marker)
                     (org-agenda-error)))
         (buffer (marker-buffer marker))
         (pos (marker-position marker)))
    (with-current-buffer buffer
      (save-excursion
        (goto-char pos)
        (org-roam-dailies-capture-today)))))

(defun my/get-daily-agenda (&optional date)
  "Return the agenda for the day as a string."
  (interactive)
  (let ((file (make-temp-file "daily-agenda" nil ".txt")))
    (org-agenda nil "d" nil)
    (when date (org-agenda-goto-date date))
    (org-agenda-write file nil nil "*Org Agenda(d)*")
    (kill-buffer)
    (with-temp-buffer
      (insert-file-contents file)
      (goto-char (point-min))
      (kill-line 2)
      (while (re-search-forward "^  " nil t)
        (replace-match "- " nil nil))
      (buffer-string))))
#+end_src

#+RESULTS:
: my/get-daily-agenda

*** TODO Tell Org-Agenda About The Custom Commands
#+begin_src emacs-lisp
;; Customize the default Org agenda command to include Org Roam daily files
(setq org-agenda-custom-commands
      '(("d" "Org Roam Daily Files"
         ((agenda "" ((org-agenda-files (list "~/org/roam/daily"))))
          (function my/org-roam-today-mk-agenda-link)
          (function my/get-daily-agenda)))))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
;; Add daily files to the default agenda files list
(setq org-agenda-files (append org-agenda-files
                               (list "~/org/roam/daily")))
#+end_src


#+RESULTS:
| ~/org/roam/daily |

** PDF Tools setup/install
#+begin_src emacs-lisp
(use-package! pdf-tools
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install)
  (setq-default pdf-view-display-size 'fit-page))
#+end_src

   #+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))
   #+end_src
** Org-Noter Setup/install
  #+begin_src emacs-lisp

(use-package! org-noter
  :defer t
  :commands (org-noter)
  ;; Make sure it loads after org and pdf-view are available:
  :after (org pdf-view)
  :config
  ;; Where to store the notes (Org) files if :NOTER_DOCUMENT: is missing:
  (setq org-noter-notes-search-path '("~/org/roam/" "~/org/notes/"))

  ;; By default, new notes buffer spawns below the PDF; change if you want:
  (setq org-noter-notes-window-location 'right
        org-noter-doc-split-fraction '(0.5 . 0.5)
        org-noter-auto-save-last-location t)

  ;; You can also unify it with org-roam, if desired:
  (org-noter-enable-org-roam-integration)

  (map! :map org-noter-doc-mode-map
		:desc "Insert Note"
		:n (kbd "C-i") #'org-noter-insert-note)
	(map! :map org-noter-doc-mode-map
		:n "M-i" #'org-noter-insert-precise-note
		:desc "Insert Precise Note")
)
  #+end_src


*** More Org-Centric Custom Commands
#+begin_src emacs-lisp
(defun my/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun my/org-roam-list-notes-by-tag (tag-name)
  (mapcar #'org-roam-node-file
          (seq-filter
           (my/org-roam-filter-by-tag tag-name)
           (org-roam-node-list))))

(defun my/org-roam-refresh-agenda-list ()
  (interactive)
  (setq org-agenda-files (my/org-roam-list-notes-by-tag "Project")))

;; Build the agenda list the first time for the session
(my/org-roam-refresh-agenda-list)
#+end_src

#+RESULTS:

**** Automatically move completed todos to dailies
#+begin_src emacs-lisp
(after! org
(defun my/org-roam-create-daily-file-if-needed ()
  "Create the daily file with the specified template if it doesn't exist."
  (let* ((date-string (format-time-string "%Y-%m-%d"))
         (file-name (concat date-string ".org"))
         (file-path (expand-file-name file-name "~/org/roam/daily"))
         (file-exists (file-exists-p file-path))
         (template
             (concat "#+title: %<%Y-%m-%d (%a)>\n"
                           "#+startup: showall\n"
                           "#+Filetags: :dailies:\n* daily overview\n"
                           "#+export_file_name: ~/org/exported/dalies/"
                           "\n#+begin_src emacs-lisp :results value raw\n"
                           "(my/get-daily-agenda \"" (format-time-string "%Y-%m-%d") "\")\n"
                           "#+end_src\n"
                           "#+ Last Daily Entry: "
                           "\n*  [/] do today\n* [/] maybe do today\n* journal\n* [/] Completed Tasks\n")))
        (unless file-exists
      (with-temp-buffer
        (insert template)
        (write-file file-path)))
    file-path)))
#+end_src

#+RESULTS:
: my/org-roam-create-daily-file-if-needed

#+begin_src emacs-lisp
(after! org
  (defun my/org-roam-copy-heading-to-today ()
    "Copy the heading of a completed TODO to today's daily file with state-specific formatting."
    (interactive)
    (let* ((today-file (my/org-roam-create-daily-file-if-needed))
           (original-file (buffer-file-name))
           (heading (save-excursion
                     (org-back-to-heading t)
                     (org-get-heading t t t t)))
           (org-roam-id (org-roam-id-at-point))
           (link-to-original (if org-roam-id
                                (org-link-make-string (concat "id:" org-roam-id) heading)
                              (org-link-make-string (concat "file:" (expand-file-name original-file) "::" heading) heading)))
           (current-state (org-get-todo-state))
           (status-prefix
            (cond
             ((string= current-state "DONE") "✓ DONE")
             ((string= current-state "KILL") "✗ KILLED")
             ((string= current-state "WAIT") "⏳ WAITING")
             ((string= current-state "HOLD") "⏸️ HOLD")
             ((string= current-state "PROJ") "📌 PROJECT")
             ((string= current-state "LOOP") "🔄 LOOP")
             ((string= current-state "STRT") "▶️ STARTED")
             ((string= current-state "IDEA") "💡 IDEA")
             ((string= current-state "OKAY") "👍 OKAY")
             ((string= current-state "YES")  "✅ YES")
             ((string= current-state "NO")   "❌ NO")
             ((string= current-state "TODO") "📝 TODO")
             (t current-state)))
           (section-name
            (cond
             ((string= current-state "DONE") "* [/] Completed Tasks")
             ((string= current-state "KILL") "* [/] Killed Tasks")
             ((member current-state '("WAIT" "HOLD")) "* [/] Waiting/Held Tasks")
             ((member current-state '("YES" "OKAY")) "* [/] Approved Tasks")
             ((member current-state '("NO")) "* [/] Rejected Tasks")
             (t "* [/] State Changes")))
           (entry (format "** %s %s [%s]"
                         status-prefix
                         link-to-original
                         (format-time-string "%Y-%m-%d %a %H:%M")))
           (already-added nil))
      ;; Check if the heading is already in the daily file
      (with-current-buffer (find-file-noselect today-file)
        (goto-char (point-min))
        (while (re-search-forward (format "^** [^*]+ %s" (regexp-quote heading)) nil t)
          (setq already-added t)))
      ;; Only append if the heading is not already in the file
      (unless already-added
        (with-current-buffer (find-file-noselect today-file)
          (goto-char (point-min))
          ;; Ensure section heading exists
          (unless (re-search-forward (regexp-quote section-name) nil t)
            (goto-char (point-max))
            (insert "\n" section-name))
          (re-search-forward (regexp-quote section-name) nil t)
          (outline-end-of-subtree)
          (insert "\n" entry)
          (save-buffer)))
      (org-roam-db-sync)))

  (defun my/org-roam-handle-todo ()
    "Handle TODO items by copying their heading to today's daily file when their state changes."
    (interactive)
    (let ((current-state (org-get-todo-state)))
      (when (member current-state
                    '("DONE" "KILL" "WAIT" "HOLD" "YES" "NO" "OKAY"))
        (my/org-roam-copy-heading-to-today))))
  (add-hook 'org-after-todo-state-change-hook #'my/org-roam-handle-todo))

#+end_src

#+RESULTS:
| my/org-roam-handle-todo |

