config.org
** Org-Roam-Obsidian Interop
I'm split between using org roam and obsidian right now, and am not sure which I wanna use. I prefer org roam for the full functionality, but greatly appreceate obsidians' ease of use. I tend to bounce back and forwarth with using obsidian as note taking and then org for evertything else (like daily organization and stuff)

ANyways I had an idea, what if I wrote a script that goes over my FULL roam directory, and for every link, inserts a duplicate link but inside the org-roam files drawer, so it's hidden, but we maintain connections within the database or something?
might be neat
#+begin_src emacs-lisp :tangle yes
(defun my/org-roam-add-obsidian-compatibility ()
  "Update each Org-roam note with Obsidian-compatible properties for links and tags."
  (interactive)
  ;; Ensure Org-roam is loaded, and its DB is up-to-date.
  (require 'org-roam)
  (org-roam-db-sync)

  (message "Starting Org-roam to Obsidian compatibility updates...")

  ;; Grab a list of all nodes using org-roam-node-list
  (let ((nodes (org-roam-node-list)))
    (dolist (node nodes)
      (let* ((org-file (org-roam-node-file node))
             (org-tags (org-roam-node-tags node))
             (org-filetags (org-roam-node-tags node)) ; Filetags doesn't work so I'm just doin this
             (all-tags (append org-tags org-filetags))
             ;; Convert to Obsidian-style tags (#tag)
             (obsidian-tags (mapcar (lambda (tag) (format "#%s" tag)) all-tags))
             (tags-string (string-join obsidian-tags " ")))

        ;; Only operate on files that actually exist
        (when (and org-file (file-exists-p org-file))
          (with-current-buffer (find-file-noselect org-file)
            (save-excursion
              (goto-char (point-min))
              ;; Check if "File Data" heading already exists in the buffer.
              (let ((file-data-heading-pos
                     (org-find-exact-headline-in-buffer "File Data")))
                (if file-data-heading-pos
                    (goto-char file-data-heading-pos)  ; jump there if found
                  (org-insert-heading)                 ; else create new heading
                  (insert "File Data\n")))

              ;; Collect all Org-roam links in the file
              (let (wikilinks)
                (let ((parsed-org (org-element-parse-buffer)))
                  (org-element-map parsed-org 'link
                    (lambda (link)
                      ;; Try to detect an Org-roam link:
                      (when (my/org-roam-link-p link)
                        (let* ((target-node (my/org-roam-resolve-link link))
                               (target-title (and target-node
                                                  (org-roam-node-title target-node))))
                          (when target-title
                            (push (format "[[%s]]" target-title) wikilinks)))))))
                ;; Store them in a single property if any are found
                (when wikilinks
                  (org-set-property "Obsidian-Links"
                                    (string-join (nreverse wikilinks) " "))))

              ;; Store Obsidian-style tags if any
              (when (and all-tags (not (string= tags-string "")))
                (org-set-property "Obsidian-Tags" tags-string))

              (save-buffer))
            (kill-buffer))))))

  (message "Finished Org-roam to Obsidian compatibility updates."))

(defun my/org-roam-link-p (link)
  "Return non-nil if LINK is recognized as an Org-roam link.
This is a simple check for an 'id' link or a file link that Org-roam can handle.
Adjust if your Org-roam version uses a different convention."
  (let ((type (org-element-property :type link))
        (path (org-element-property :path link)))
    ;; If it's an 'id:' link, see if we can resolve a node from that ID.
    (cond
     ((string= type "id")
      (org-roam-node-from-id path))  ;; returns nil if no node is found
     ;; If you also want to catch 'file:' links that point to a roam note:
     ;; ((string= type "file")
     ;;  ...some check to see if it corresponds to a known Roam note...)
     (t nil))))
(defun my/org-roam-resolve-link (link)
  "Resolve an Org-roam LINK to its corresponding node.
Returns the Org-roam node if found, otherwise nil."
  (let ((type (org-element-property :type link))
        (path (org-element-property :path link)))
    (when (string= type "id")
      (org-roam-node-from-id path))))

#+end_src
#+RESULTS:
: my/org-roam-resolve-link

* Language Stuff
doom emacs is super nice in having a lot of easy configuration found in the [[doomdir: init.el][init.el]] file, but for anything that doesn't come with doom, I likely have to add it to the [[doomdir:packages.el][packages.el]] file, and handle it here
either that, or just specify options for stuff that needs it
** Flycheck
#+begin_src emacs-lisp
(use-package! flycheck
  :ensure t
  :defer t
  :diminish
  :init (global-flycheck-mode))
#+end_src

#+RESULTS:

** LSP Stuff in particular
*** File Templates:
#+begin_src emacs-lisp
(set-file-template! "\\.pro" :trigger "__" :mode 'prolog-mode)
#+end_src

#+RESULTS:

